[
    {
        "courseName": "javascript",
        "url": "javascript",
        "totalLearner": 10,
        "totalClass": "30+",
        "courseImage": "https://sololearnuploads.azureedge.net/uploads/courses/1024.png",
        "posts": [
            {
                "title": "variable",
                "videoLink": "https://youtu.be/_ty_D0I4-GQ",
                "description": "variable একটি গ্লাস, যেখানে আমরা পানি Store করে রাখতে পারি। এবং প্রয়োজন পড়লে সেই পানি ফেলে দিয়ে নতুন পানি সেখানে নিয়ে কাজ করতে পারি।  প্রোগ্রামিং এর ক্ষেত্রেও ভেরিয়েবল ব্যাপারটা সেরকম। আমরা একটা ভেরিয়েবল ডিক্লার করে, সেখানে কোনো Number, Array, String, Object রাখতে পারি। এবং তা প্রয়োজনে পরিবর্তন করে দিতে পারি। যে ভেরিয়েবলের মান পরিবর্তন হবে, সেই ভেরিয়েবলকে আমরা let দিয়ে ডিক্লেয়ার করব। তাছাড়া আমরা ভেরিয়েবলকে const দিয়ে ডিক্লেয়ার করব।"
            },
            {
                "title": "loop",
                "videoLink": "https://youtu.be/cp1u9S6S9UA",
                "description": "loop মানে একটা ফাঁদ। যেখানে ঢুকে পড়লে নিজের ইচ্ছায় বের হওয়া যায় না। ৩৩ বার চেষ্টার পর বের হওয়া যায় লুপ থেকে। মজা করলাম, ১ বারের চেষ্টাও এই ফাঁদ থেকে বের হওয়া যায়, আবার হাজার বার চেষ্টা করেও বের হওয়া যায় না।"
            },
            {
                "title": "Array",
                "videoLink": "https://youtu.be/QDVPtc_yE4Q",
                "description": "অনেকগুলো মেয়ের সাথে প্রেম করিস। ১ম জন যে ছিল তার মেরিনা, তারপরের জনের নাম বিথী, তারপরের জনের নাম সুমি। অর্থাৎ ১নম্বরে ছিল মেরিনা, ২নম্বরে ছিল বিথী, ৩ নম্বরের ছিল সুমি। এরা সবাই তোর প্রেমিকা। বিয়ে করলে এদের সবাইকে একই বাড়িতে রাখতে হবে। myPremikaList = Merina, Bithy, Sumi. myPremika এর মধ্যে কয়টি উপাদান আছে বের করব-  girls.length দিয়ে। আবার, Merina মেয়েটির index নাম্বার কত? array এর 3 নম্বর পজিশনে কে আছে কিভাবে বের করব?"
            },
            {
                "title": "Object",
                "videoLink": "https://youtu.be/4_CrKt6o9LA",
                "description": "আমাদের আশেপাশে যা কিছু দেখি সবকিছুই অবজেক্ট। বিজ্ঞানের ভাষায় যার জীবন নাই, তা অবজেক্ট। কিন্তু প্রোগ্রামিং এর ভাষায় জীব, জড় সবি অবজেক্ট। প্রত্যেকটা অবজেক্টের নির্দিষ্ট কিছু বৈশিষ্ট্য থাকে। ধর, তোর গার্লফ্রেন্ড একটা অবজেক্ট। তার বৈশিষ্ট্য গুলো লিখে একটা খামের রাখাই প্রোগ্রামিং এ অবজেক্ট ডিক্লার করা। "
            }
            
        ]
    },
    {
        "courseName": "HSC ICT (Batch 1)",
        "url": "hsc-ict",
        "totalLearner": "--",
        "totalClass": "50+" ,
        "courseImage": "https://i.ibb.co/dr47WSv/ict.png",
        "posts": [
            {
                "title": "1st Week",
                "description": "১ সপ্তাহে আমরা পড়বো, ৪র্থ অধ্যায়- ওয়েব ডিজাইন এবং HTML। এখানে তোমাকে পড়ানো হবে- ওয়েব পেজ কি, ডোমেইন কি, হোস্টিং কি, আইপি এড্রেস কি? এবং তোমাদের হাতে কলমে HTML দিয়ে একটি ওয়েবসাইট তৈরি করে দেখানো হবে। "
            },
            {
                "title": "2nd Week",
                "description": "২য় সপ্তাহে আমরা পড়বো, প্রোগ্রামিং কি? খায় না মাথায় দেয়! বুঝবো variable, if-else, loop, function. আমরা হাতে কলমে করব কিভাবে একটি যোগ বিয়োগ গুণ ভাগ ক্যালকুলেটর বানানো যায়। আরও মজার মজার অনেক জিনিস শিখবো। একজন বিয়ের যোগ্য কী'না তা বের করার প্রোগাম শিখবো। তোমার এখন কয় বছর, কয় মাস, কয় দিন তা বের করার প্রোগ্রাম শিখবো" 
            }
        ]
    }
]